{
  "nome_completo": "RODRIGO FREITAS DOS REIS",
  "cargo_desejado": "Desenvolvedor | Analista de Sistemas",
  "contato": {
    "email": "rfsier@gmail.com",
    "telefone": "+55 51 99606-4403",
    "localizacao": "Rio Grande do Sul, Brasil"
  },
  "resumo_profissional": "Profissional com mais de 20 anos de experiência em liderança e otimização de processos, atualmente em transição de carreira para a área de Tecnologia da Informação. Busco alavancar uma profunda compreensão de operações de negócio para atuar na análise, desenvolvimento e implementação de sistemas de software eficazes. Cursando Análise e Desenvolvimento de Sistemas e com conhecimento em C# & .NET, JavaScript, TypeScript, CSS, Android(Kotlin), Python, pacote Office avançado e outros, além de possuir forte capacidade para traduzir requisitos de negócio em especificações técnicas e soluções de software que geram resultados mensuráveis.",
  "experiencias": [
    {
      "cargo": "Supervisor Geral",
      "empresa": "CEREALISTA OLIVEIRA LTDA",
      "periodo": "2007 - Atual",
      "descricao": "* Atuei como ponto focal na implementação e otimização de módulos do sistema de gestão (ERP), resultando em melhorias de eficiência e redução de erros nos setores de Logística e Financeiro.\n\n* Liderei projetos de otimização, atuando como interface direta com os desenvolvedores da Sysmo na co-criação de soluções de software para a logística reversa do setor atacadista.\n\n* Participei ativamente da implantação do aplicativo ClubeOliveira, desde a definição de requisitos até o lançamento, garantindo que a solução atendesse tanto às necessidades do negócio quanto dos usuários finais.\n\n* Utilizei software de análise para monitorar indicadores de performance (KPIs), direcionando melhorias nos processos administrativos e logísticos que aprimoraram a tomada de decisão baseada em dados."
    },
    {
      "cargo": "Gerente Comercial",
      "empresa": "NEW POINT INFORMÁTICA SA",
      "periodo": "1998 - 2003 / 2018 - 2019",
      "descricao": "* Liderei a otimização de processos comerciais e operacionais em diversas filiais, identificando gargalos e implementando novas rotinas de trabalho com apoio de sistemas internos.\n\n* Atuei como instrutor e mentor técnico, ministrando cursos de capacitação em software para as equipes, garantindo a excelência na utilização das ferramentas e a qualidade da entrega ao cliente.\n\n* Utilizei análise de dados para desenvolver e aplicar estratégias de negociação que resultaram na redução da inadimplência e superação de metas de vendas."
    }
  ],
  "formacao": [
    {
      "curso": "SUPERIOR ANÁLISE E DESENVOLVIMENTO DE SISTEMAS",
      "instituicao": "FACULDADES ANHANGUERA",
      "periodo": "JUL/2023 _ ATUAL"
    },
    {
      "curso": "FORMAÇÃO EM C# & .NET",
      "instituicao": "ROCKETSEAT",
      "periodo": "Em andamento"
    },
    {
      "curso": "C# E SQL",
      "instituicao": "Udemy",
      "periodo": "Consluido"
    },
    {
      "curso": "Desenvolvimento Web Moderno com JavaScript",
      "instituicao": "Udemy",
      "periodo": "Concluido"
    },
    {
      "curso": "Controle de Versão com Git e GitHub",
      "instituicao": "Udemy",
      "periodo": "Concluido"
    }
  ],
  "competencias": [
    {
      "competencia": "TECNOLOGIAS E LINGUAGENS"
    },
    {
      "competencia": "C# & .NET (em formação)"
    },
    {
      "competencia": "Lógica de Programação"
    },
    {
      "competencia": "SQL (Básico/Intermediário)"
    },
    {
      "competencia": "Git / Versionamento de Código"
    },
    {
      "competencia": "JavaScript"
    },
    {
      "competencia": "TypeScript"
    },
    {
      "competencia": "METODOLOGIAS E HABILIDADES TÉCNICAS"
    },
    {
      "competencia": "Análise e Implantação de Processos"
    },
    {
      "competencia": "Tradução de Requisitos de Negócio"
    },
    {
      "competencia": "Gestão de Projetos de Software"
    },
    {
      "competencia": "Análise de Dados para Tomada de Decisão"
    },
    {
      "competencia": "HABILIDADES INTERPESSOAIS E DE GETÃO"
    },
    {
      "competencia": "Liderança e Formação de Equipes Técnicas"
    },
    {
      "competencia": "Rápida Aprendizagem e Adaptação a Novas Tecnologias"
    },
    {
      "competencia": "Comunicação Interdepartamental (Negócio e TI)"
    },
    {
      "competencia": "Resolução de Problemas Complexos"
    }
  ],
  "redes_sociais": [
    {
      "rede": "Faceboock",
      "url": "https://www.facebook.com/digaodev.reis"
    },
    {
      "rede": "Instagram",
      "url": "https://www.instagram.com/rodrigofreis7"
    },
    {
      "rede": "Github",
      "url": "https://github.com/digaoreisdev"
    }
  ],
  "projetos": [
    {
      "nome": "MidiaReis",
      "link": "https://github.com/digaoreisdev/midiasreis",
      "descricao": "MídiasReis | Desenvolvedor Android (Projeto Autônomo)\nResponsável pelo ciclo completo de desenvolvimento (da concepção à implementação) de um ecossistema de Mídia Digital (DOOH) e E-commerce para telas veiculares, com foco em operação offline-first.\n\nArquitetei e desenvolvi o player de mídia principal do sistema, um motor inteligente que gerencia a exibição de campanhas publicitárias com metas contratuais, notícias, e curiosidades geradas dinamicamente via IA (Google Gemini).\n\nImplementei um sistema de gerenciamento de conteúdo (CMS) embarcado para administração de todas as entidades do app (Campanhas, Mídias, Produtos, Usuários), garantindo operação 100% offline com persistência de dados via RoomDB.\n\nIntegrei um conjunto de APIs externas (Google Places, FIPE, ViaCEP, Clima, Notícias) para enriquecer a plataforma com dados contextuais e em tempo real, além de automatizar processos de cadastro.\n\nDesenvolvi uma funcionalidade robusta de backup e restauração completa do sistema, permitindo a portabilidade de dados e mídias através da serialização em JSON (Gson) e compressão ZIP.\n\nCriei serviços em background (Service) para tarefas assíncronas críticas, como a prospecção de leads comerciais baseada na geolocalização do veículo."
    },
    {
      "nome": "Gerador de Curriculo PDF",
      "link": "https://github.com/digaoreisdev/gerador-curriculo-pdf",
      "descricao": "Aplicação em Python para gerar um currículo profissional em formato PDF a partir de um formulário."
    },
    {
      "nome": "PadReis",
      "link": "https://github.com/digaoreisdev/PadReis",
      "descricao": "🚀 VISÃO GERAL DO PROJETO O \"PadReis\" é um sistema web interno projetado para otimizar e centralizar o fluxo de pedidos entre as lojas filiais e a central de produção de uma rede de supermercados. A plataforma permite que as filiais criem pedidos de produtos de padaria, confeitaria e rotisseria, enquanto a central gere o ciclo de produção e envio, garantindo controle, rastreabilidade e acesso a relatórios vitais para a operação."
    }
  ]
}